---
kind: property
id: P:Autodesk.Revit.DB.Transform2D.Determinant
source: html/bfd34778-23af-005d-0c2f-1c6a77bffe10.htm
---
# Autodesk.Revit.DB.Transform2D.Determinant Property

The determinant of this transformation.

## Syntax (C#)
```csharp
public double Determinant { get; }
```

## Remarks
The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.